zephyrproject-rtos/hal_atmel/include/dt-bindings/pinctrl/samd51p-pinctrl.h
/* pb26f_tcc1_wo2 */
#define PB26F_TCC1_WO2 \
	SAM_PINMUX(b, 26, f, periph)

/* pb27_gpio */
#define PB27_GPIO \
	SAM_PINMUX(b, 27, gpio, gpio)

/* pb27a_eic_extint13 */
#define PB27A_EIC_EXTINT13 \
	SAM_PINMUX(b, 27, a, periph)

/* pb27c_sercom2_pad1 */
#define PB27C_SERCOM2_PAD1 \
	SAM_PINMUX(b, 27, c, periph)

/* pb27d_sercom4_pad0 */
#define PB27D_SERCOM4_PAD0 \
	SAM_PINMUX(b, 27, d, periph)

/* pb27f_tcc1_wo3 */
#define PB27F_TCC1_WO3 \
	SAM_PINMUX(b, 27, f, periph)

/* pb28_gpio */
#define PB28_GPIO \
	SAM_PINMUX(b, 28, gpio, gpio)

/* pb28a_eic_extint14 */
#define PB28A_EIC_EXTINT14 \
	SAM_PINMUX(b, 28, a, periph)

/* pb28c_sercom2_pad2 */
#define PB28C_SERCOM2_PAD2 \
	SAM_PINMUX(b, 28, c, periph)

/* pb28d_sercom4_pad2 */
#define PB28D_SERCOM4_PAD2 \
	SAM_PINMUX(b, 28, d, periph)

/* pb28f_tcc1_wo4 */
#define PB28F_TCC1_WO4 \
	SAM_PINMUX(b, 28, f, periph)

/* pb28j_iis_sck1 */
#define PB28J_IIS_SCK1 \
	SAM_PINMUX(b, 28, j, periph)

/* pb29_gpio */
#define PB29_GPIO \
	SAM_PINMUX(b, 29, gpio, gpio)

/* pb29a_eic_extint15 */
#define PB29A_EIC_EXTINT15 \
	SAM_PINMUX(b, 29, a, periph)

/* pb29c_sercom2_pad3 */
#define PB29C_SERCOM2_PAD3 \
	SAM_PINMUX(b, 29, c, periph)

/* pb29d_sercom4_pad3 */
#define PB29D_SERCOM4_PAD3 \
	SAM_PINMUX(b, 29, d, periph)

/* pb29f_tcc1_wo5 */
#define PB29F_TCC1_WO5 \
	SAM_PINMUX(b, 29, f, periph)

/* pb29j_iis_mck1 */
#define PB29J_IIS_MCK1 \
	SAM_PINMUX(b, 29, j, periph)

/* pb30_gpio */
#define PB30_GPIO \
	SAM_PINMUX(b, 30, gpio, gpio)

/* pb30a_eic_extint14 */
#define PB30A_EIC_EXTINT14 \
	SAM_PINMUX(b, 30, a, periph)

/* pb30d_sercom5_pad1 */
#define PB30D_SERCOM5_PAD1 \
	SAM_PINMUX(b, 30, d, periph)

/* pb30e_tc0_wo0 */
#define PB30E_TC0_WO0 \
	SAM_PINMUX(b, 30, e, periph)

/* pb30f_tcc4_wo0 */
#define PB30F_TCC4_WO0 \
	SAM_PINMUX(b, 30, f, periph)

/* pb30g_tcc0_wo6 */
#define PB30G_TCC0_WO6 \
	SAM_PINMUX(b, 30, g, periph)

/* pb30h_swd_swo */
#define PB30H_SWD_SWO \
	SAM_PINMUX(b, 30, h, periph)

/* pb31_gpio */
#define PB31_GPIO \
	SAM_PINMUX(b, 31, gpio, gpio)

/* pb31a_eic_extint15 */
#define PB31A_EIC_EXTINT15 \
	SAM_PINMUX(b, 31, a, periph)

/* pb31d_sercom5_pad0 */
#define PB31D_SERCOM5_PAD0 \
	SAM_PINMUX(b, 31, d, periph)

/* pb31e_tc0_wo1 */
#define PB31E_TC0_WO1 \
	SAM_PINMUX(b, 31, e, periph)

/* pb31f_tcc4_wo1 */
#define PB31F_TCC4_WO1 \
	SAM_PINMUX(b, 31, f, periph)

/* pb31g_tcc0_wo7 */
#define PB31G_TCC0_WO7 \
	SAM_PINMUX(b, 31, g, periph)

/* pc0_gpio */
#define PC0_GPIO \
	SAM_PINMUX(c, 0, gpio, gpio)

/* pc0a_eic_extint0 */
#define PC0A_EIC_EXTINT0 \
	SAM_PINMUX(c, 0, a, periph)

/* pc0b_adc1_ain10 */
#define PC0B_ADC1_AIN10 \
	SAM_PINMUX(c, 0, b, periph)

/* pc1_gpio */
#define PC1_GPIO \
	SAM_PINMUX(c, 1, gpio, gpio)

/* pc1a_eic_extint1 */
#define PC1A_EIC_EXTINT1 \
	SAM_PINMUX(c, 1, a, periph)

/* pc1b_adc1_ain11 */
#define PC1B_ADC1_AIN11 \
	SAM_PINMUX(c, 1, b, periph)

/* pc2_gpio */
#define PC2_GPIO \
	SAM_PINMUX(c, 2, gpio, gpio)

/* pc2a_eic_extint2 */
#define PC2A_EIC_EXTINT2 \
	SAM_PINMUX(c, 2, a, periph)

/* pc2b_adc1_ain4 */
#define PC2B_ADC1_AIN4 \
	SAM_PINMUX(c, 2, b, periph)

/* pc3_gpio */
#define PC3_GPIO \
	SAM_PINMUX(c, 3, gpio, gpio)

/* pc3a_eic_extint3 */
#define PC3A_EIC_EXTINT3 \
	SAM_PINMUX(c, 3, a, periph)

/* pc3b_adc1_ain5 */
#define PC3B_ADC1_AIN5 \
	SAM_PINMUX(c, 3, b, periph)

/* pc4_gpio */
#define PC4_GPIO \
	SAM_PINMUX(c, 4, gpio, gpio)

/* pc4a_eic_extint4 */
#define PC4A_EIC_EXTINT4 \
	SAM_PINMUX(c, 4, a, periph)

/* pc4c_sercom6_pad0 */
#define PC4C_SERCOM6_PAD0 \
	SAM_PINMUX(c, 4, c, periph)

/* pc4f_tcc0_wo0 */
#define PC4F_TCC0_WO0 \
	SAM_PINMUX(c, 4, f, periph)

/* pc5_gpio */
#define PC5_GPIO \
	SAM_PINMUX(c, 5, gpio, gpio)

/* pc5a_eic_extint5 */
#define PC5A_EIC_EXTINT5 \
	SAM_PINMUX(c, 5, a, periph)

/* pc5c_sercom6_pad1 */
#define PC5C_SERCOM6_PAD1 \
	SAM_PINMUX(c, 5, c, periph)

/* pc6_gpio */
#define PC6_GPIO \
	SAM_PINMUX(c, 6, gpio, gpio)

/* pc6a_eic_extint6 */
#define PC6A_EIC_EXTINT6 \
	SAM_PINMUX(c, 6, a, periph)

/* pc6c_sercom6_pad2 */
#define PC6C_SERCOM6_PAD2 \
	SAM_PINMUX(c, 6, c, periph)

/* pc6i_sdhc0_cd */
#define PC6I_SDHC0_CD \
	SAM_PINMUX(c, 6, i, periph)

/* pc7_gpio */
#define PC7_GPIO \
	SAM_PINMUX(c, 7, gpio, gpio)

/* pc7a_eic_extint7 */
#define PC7A_EIC_EXTINT7 \
	SAM_PINMUX(c, 7, a, periph)

/* pc7c_sercom6_pad3 */
#define PC7C_SERCOM6_PAD3 \
	SAM_PINMUX(c, 7, c, periph)

/* pc7i_sdhc0_wp */
#define PC7I_SDHC0_WP \
	SAM_PINMUX(c, 7, i, periph)

/* pc10_gpio */
#define PC10_GPIO \
	SAM_PINMUX(c, 10, gpio, gpio)

/* pc10a_eic_extint10 */
#define PC10A_EIC_EXTINT10 \
	SAM_PINMUX(c, 10, a, periph)

/* pc10c_sercom6_pad2 */
#define PC10C_SERCOM6_PAD2 \
	SAM_PINMUX(c, 10, c, periph)

/* pc10d_sercom7_pad2 */
#define PC10D_SERCOM7_PAD2 \
	SAM_PINMUX(c, 10, d, periph)

/* pc10f_tcc0_wo0 */
#define PC10F_TCC0_WO0 \
	SAM_PINMUX(c, 10, f, periph)

/* pc10g_tcc1_wo4 */
#define PC10G_TCC1_WO4 \
	SAM_PINMUX(c, 10, g, periph)

/* pc11_gpio */
#define PC11_GPIO \
	SAM_PINMUX(c, 11, gpio, gpio)

/* pc11a_eic_extint11 */
#define PC11A_EIC_EXTINT11 \
	SAM_PINMUX(c, 11, a, periph)

/* pc11c_sercom6_pad3 */
#define PC11C_SERCOM6_PAD3 \
	SAM_PINMUX(c, 11, c, periph)

/* pc11d_sercom7_pad3 */
#define PC11D_SERCOM7_PAD3 \
	SAM_PINMUX(c, 11, d, periph)

/* pc11f_tcc0_wo1 */
#define PC11F_TCC0_WO1 \
	SAM_PINMUX(c, 11, f, periph)

/* pc11g_tcc1_wo5 */
#define PC11G_TCC1_WO5 \
	SAM_PINMUX(c, 11, g, periph)

/* pc12_gpio */
#define PC12_GPIO \
	SAM_PINMUX(c, 12, gpio, gpio)

/* pc12a_eic_extint12 */
#define PC12A_EIC_EXTINT12 \
	SAM_PINMUX(c, 12, a, periph)

/* pc12c_sercom7_pad0 */
#define PC12C_SERCOM7_PAD0 \
	SAM_PINMUX(c, 12, c, periph)

/* pc12d_sercom6_pad1 */
#define PC12D_SERCOM6_PAD1 \
	SAM_PINMUX(c, 12, d, periph)

/* pc12f_tcc0_wo2 */
#define PC12F_TCC0_WO2 \
	SAM_PINMUX(c, 12, f, periph)

/* pc12g_tcc1_wo6 */
#define PC12G_TCC1_WO6 \
	SAM_PINMUX(c, 12, g, periph)

/* pc12k_pcc_data10 */
#define PC12K_PCC_DATA10 \
	SAM_PINMUX(c, 12, k, periph)

/* pc13_gpio */
#define PC13_GPIO \
	SAM_PINMUX(c, 13, gpio, gpio)

/* pc13a_eic_extint13 */
#define PC13A_EIC_EXTINT13 \
	SAM_PINMUX(c, 13, a, periph)

